Hello again @treywelsh @frousselet ! I saw that a new version was released so I have returned to the issue again. But the error is still the same with v1.2.2. See below:


```html
Terraform will perform the following actions:

  # opennebula_service.service will be created
  + resource "opennebula_service" "service" {
      + gid         = (known after apply)
      + gname       = (known after apply)
      + id          = (known after apply)
      + name        = "ig1-one-acceptance-svc-01"
      + networks    = (known after apply)
      + permissions = "760"
      + roles       = (known after apply)
      + state       = (known after apply)
      + template_id = (known after apply)
      + uid         = (known after apply)
      + uname       = (known after apply)
    }

  # opennebula_service_template.service_template will be created
  + resource "opennebula_service_template" "service_template" {
      + gid         = (known after apply)
      + gname       = (known after apply)
      + id          = (known after apply)
      + name        = "ig1-one-acceptance-svc"
      + permissions = "760"
      + template    = jsonencode(
            {
              + TEMPLATE = {
                  + BODY = {
                      + deployment = "straight"
                      + name       = "ig1-one-acceptance-svc"
                      + roles      = [
                          + {
                              + cardinality = 3
                              + min_vms     = 2
                              + name        = "master"
                              + vm_template = 2
                            },
                        ]
                    }
                }
            }
        )
      + uid         = (known after apply)
      + uname       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opennebula_service_template.service_template: Creating...
╷
│ Error: Failed to create the service template
│ 
│   with opennebula_service_template.service_template,
│   on one_resource_service.tf line 19, in resource "opennebula_service_template" "service_template":
│   19: resource "opennebula_service_template" "service_template" {
│ 
│ <!DOCTYPE html>
│ <html>
│ <head>
│   <style type="text/css">
│   body { text-align:center;font-family:helvetica,arial;font-size:22px;
│     color:#888;margin:20px}
│   #c {margin:0 auto;width:500px;text-align:left}
│   </style>
│ </head>
│ <body>
│   <h2>Sinatra doesn’t know this ditty.</h2>
│   <img src='http://IP_FLOW_ENDPOINT/__sinatra__/404.png'>
│   <div id="c">
│     Try this:
│     <pre>post &#x27;&#x2F;RPC2&#x2F;service_template&#x27; do
│   &quot;Hello World&quot;
│ end
│ </pre>
│   </div>
│ </body>
│ </html>
│ 
╵
``` 

Do you have an estimated release date for version v1.3.0? 
Thanks!